### Pandas Lab -- Grouping & Merging

Welcome to today's lab!  It will come in two different parts:  

One section will be devoted to using the `groupby` method in order to answer different questions about our data.  

The second portion will be devoted towards combining grouping & merging to create summary statistics -- one of the more important features you can add to a dataset for statistical modeling.

### Section I - Grouping

**Question 1:** What restaurant had the highest total amount of visitors throughout the dataset?

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('/Users/harleyhoffmann/dat-02-22/ClassMaterial/Unit2/data/master.csv', parse_dates=['visit_date', 'calendar_date'])

In [3]:
# your answer here
df.groupby('id')['visitors'].sum().nlargest()

id
air_399904bdb7685ca0    18717
air_f26f36ec4dc5adb0    18577
air_e55abd740f93ecc4    18101
air_99157b6163835eec    18097
air_5c817ef28f236bdf    18009
Name: visitors, dtype: int64

In [ ]:
air_399904bdb7685ca0    18717

**Question 2:** What restaurant had the highest amount of reservations?

In [13]:
# your answer here
df.groupby('id')['reserve_visitors'].nunique().nlargest().reset_index

<bound method Series.reset_index of id
air_04341b588bde96cd    49
air_04cae7c1bc9b2a0b    49
air_05c325d315cc17f5    49
air_07b314d83059c4d2    49
air_0845d8395f30c6bb    49
Name: reserve_visitors, dtype: int64>

In [ ]:
air_04341b588bde96cd    49

**Question 3:** Grab the quarterly sales for each individual restaurant within our dataset

In [8]:
# your answer here
df.groupby(['id', df.visit_date.dt.quarter])[['visitors']].sum()

id                    visit_date
air_00a91d42b08b08d9  1             2041
                      2              490
                      3             1780
                      4             1740
air_0164b9927d20bcc3  1              593
                                    ...
air_ffcc2d5087e1b476  4             1522
air_fff68b929994bfbd  1              411
                      2              102
                      3              404
                      4              452
Name: visitors, Length: 3281, dtype: int64

#### Custom Functions 

These questions will require you to use a `lambda` function to access a pandas method that is not usually available to a pandas grouper.

**Question 4:** Can you grab the first 15 rows of dates for each restaurant?  The last 15 rows? (**Hint:** Use the `apply` method for this)

In [ ]:
# your answer here
df.groupby('id').apply(lambda x: x.iloc[:15])

**Question 5:** What is the total number of missing entries for each restaurant?

In [25]:
# your answer here
df.groupby('id').apply(lambda x: x.isnull().sum().sum()).reset_index()

                       id    0
0    air_00a91d42b08b08d9  122
1    air_0164b9927d20bcc3   50
2    air_0241aa3964b7f861  249
3    air_0328696196e46f18   50
4    air_034a3d5b40d5b1b1  130
..                    ...  ...
824  air_fea5dc9594450608  139
825  air_fee8dcf4d619598e  149
826  air_fef9ccb3ba0da2f7  123
827  air_ffcc2d5087e1b476  124
828  air_fff68b929994bfbd  132

[829 rows x 2 columns]

**Question 6:**  Create two variables, `train` and `test`.  Make `train` a dataset that contains all but the **last 15 rows** for each restaurant.  Make `test` the last 15 rows for each restaurant.

In [21]:
df.sort_values(by=['id','visit_date'], inplace=True)

In [22]:
# your answer here
train = df.groupby('id').apply(lambda x: x.iloc[:-15])
test = df.groupby('id').apply(lambda x: x.iloc[-15:])

In [24]:
test

                                               id visit_date  visitors  \
id
air_00a91d42b08b08d9 167048  air_00a91d42b08b08d9 2017-04-05        35
                     167049  air_00a91d42b08b08d9 2017-04-06        29
                     167050  air_00a91d42b08b08d9 2017-04-07        17
                     167051  air_00a91d42b08b08d9 2017-04-08         9
                     167052  air_00a91d42b08b08d9 2017-04-10        17
...                                           ...        ...       ...
air_fff68b929994bfbd 216643  air_fff68b929994bfbd 2017-04-18         6
                     216644  air_fff68b929994bfbd 2017-04-19         2
                     216645  air_fff68b929994bfbd 2017-04-20         2
                     216646  air_fff68b929994bfbd 2017-04-21         4
                     216647  air_fff68b929994bfbd 2017-04-22         5

                            calendar_date day_of_week  holiday  \
id
air_00a91d42b08b08d9 167048    2017-04-05   Wednesday        0
                     167049    2017-04-06    Thursday        0
                     167050    2017-04-07      Friday        0
                     167051    2017-04-08    Saturday        0
                     167052    2017-04-10      Monday        0
...                                   ...         ...      ...
air_fff68b929994bfbd 216643    2017-04-18     Tuesday        0
                     216644    2017-04-19   Wednesday        0
                     216645    2017-04-20    Thursday        0
                     216646    2017-04-21      Friday        0
                     216647    2017-04-22    Saturday        0

                                      genre                             area  \
id
air_00a91d42b08b08d9 167048  Italian/French  Tōkyō-to Chiyoda-ku Kudanminami
                     167049  Italian/French  Tōkyō-to Chiyoda-ku Kudanminami
                     167050  Italian/French  Tōkyō-to Chiyoda-ku Kudanminami
                     167051  Italian/French  Tōkyō-to Chiyoda-ku Kudanminami
                     167052  Italian/French  Tōkyō-to Chiyoda-ku Kudanminami
...                                     ...                              ...
air_fff68b929994bfbd 216643    Bar/Cocktail        Tōkyō-to Nakano-ku Nakano
                     216644    Bar/Cocktail        Tōkyō-to Nakano-ku Nakano
                     216645    Bar/Cocktail        Tōkyō-to Nakano-ku Nakano
                     216646    Bar/Cocktail        Tōkyō-to Nakano-ku Nakano
                     216647    Bar/Cocktail        Tōkyō-to Nakano-ku Nakano

                              latitude   longitude  reserve_visitors
id
air_00a91d42b08b08d9 167048  35.694003  139.753595               2.0
                     167049  35.694003  139.753595               8.0
                     167050  35.694003  139.753595               1.0
                     167051  35.694003  139.753595              33.0
                     167052  35.694003  139.753595               NaN
...                                ...         ...               ...
air_fff68b929994bfbd 216643  35.708146  139.666288               NaN
                     216644  35.708146  139.666288               NaN
                     216645  35.708146  139.666288               1.0
                     216646  35.708146  139.666288               6.0
                     216647  35.708146  139.666288              37.0

[12435 rows x 11 columns]

### Grouping & Merging

In this section of the lab, we are going to create different types of summary statistics -- where the rows for an individual sample can be compared with a larger group statistic.

**Bonus:** If you want to make this a little bit more effective, instead of using the entire `df`, try using a grouping from the `train` variable you just created, and use the grouping's values to populate both the training and test sets.

Use the technique discussed in class to create columns for the following stats:

**Question 1:** Create columns that list the average, median and standard deviation of visitors for each restaurant

In [27]:
# your answer here
df.head()

,id,visit_date,visitors,calendar_date,day_of_week,holiday,genre,area,latitude,longitude,reserve_visitors
166836,air_00a91d42b08b08d9,2016-07-01,35,2016-07-01,Friday,0,Italian/French,Tōkyō-to Chiyoda-ku Kudanminami,35.694003,139.753595,NaN
166837,air_00a91d42b08b08d9,2016-07-02,9,2016-07-02,Saturday,0,Italian/French,Tōkyō-to Chiyoda-ku Kudanminami,35.694003,139.753595,4.0
166838,air_00a91d42b08b08d9,2016-07-04,20,2016-07-04,Monday,0,Italian/French,Tōkyō-to Chiyoda-ku Kudanminami,35.694003,139.753595,NaN
166839,air_00a91d42b08b08d9,2016-07-05,25,2016-07-05,Tuesday,0,Italian/French,Tōkyō-to Chiyoda-ku Kudanminami,35.694003,139.753595,NaN
166840,air_00a91d42b08b08d9,2016-07-06,29,2016-07-06,Wednesday,0,Italian/French,Tōkyō-to Chiyoda-ku Kudanminami,35.694003,139.753595,NaN

**Question 2:** Create a column that lists the average and median sales amount for each restaurant on a particular day of the week.

In [ ]:
# your answer here

**Question 3:** Create columns that display the average and median sales amount for each genre in each city on each day of the week.  Create a column called `city` that captures the first value of `area` in order to this.  Values should be `Tokyo`, `Hiroshima`, etc.  **Hint:** You should use the `str` attribute combined with `split` in order to do this.

In [ ]:
# your answer here